local nutHarvest = require("nut_harvest")

local tree = [[
.o.oooooo.o.o.oooooo.
..\.\.../..\.../..\..
..../..\..../....../.
.....\...././.\..\.\.
...../../././...\....
.../.../..\./.\..\...
./.......\../.\../...
....\..../....././...
.../.\._.\../._../.\.
.\...././....\../.\..
./......././.../../..




]]

local counts = oxh7(tree)
print(printResults(counts))
-- Should output: 101005000020000000040
-- من مفترض ان تكون النتيجه 101005000020000000040
--  فكره المشروع كانت من 
-- https://www.codewars.com/kata/59884371d1d8d3d9270000a5/
